"""__author__ = 唐宏进 """

"""
容器类型：字典、列表、元祖和集合
1.列表(list)：有序（可以通过下标获取元素）、可变（增删改）、列表中的元素可以是任何类型
2.列表的相关元素：增删改查
3.列表的相关运算：+，*，in/not in，len()

字典(list)：可变（增删改）、key：唯一的，不可变  value：可以是任何类型的数据
字典相关操作：增删改查
字典相关运算：in/not in，len()
字典的相关方法：.....

元祖（tuple）：有序、不可变、元素可以是任何类型的数据
查和列表一样
只有一个元素的元祖：(1,)
获取元祖中的元素：x,y = (100,200)；x,y = 100,200；*num,str1 = (1,2,3,4,'abc')

集合（set）：无序、可变是不可变的
支持数学的集合元素：包含、交集、并集、差集和补集

**函数
1.函数的声明（格式和步骤）--- 声明的时候不会执行函数体
def 函数名(参数列表):
    函数的说明文档
    函数体

2.函数的调用（格式和调用过程）
函数名()
变量()
列表[下标]()
字典[key]()

3.参数相关：位置参数、关键字参数、参数的默认值、不定长参数

4.返回值：return和None、return的作用(结束函数)

5.匿名函数：格式

6.递归函数（了解）

7.函数作为变量使用：声明函数的时候实质是在声明一个类型是function的变量
"""

