"""__author__ = 余婷"""
# python基础语法：
"""
1.注释
2.标识符：a.由字母数字下划线组成，python3中可以是中文。b.数字不能开头。c.大小敏感
3.行与缩进：python中对缩进有严格的要求
4.多行显示：加反斜杠
5.python中的基本数据类型：整型(int)、浮点型(float)、布尔(bool)、字符串(str)等
"""
abc = 10
b = 20
'name'
sum1 = 100 + 23333333 + abc\
       + 82973940712982738 + 90

# 变量的声明
"""
1.变量名 = 值
2.变量名:标识符，不能是关键字；PEP8:(字母全部小写，多个单词之间用下划线隔开)，见名知义
3.声明变量的写法
4.声明变量/给变量赋值的原理
"""
a = 100
a = b = c = 'abc'
a = 100; b = 200
a, b = 10, 20  # 元祖

# 运算符
"""
+，-，*，/,%, //, **
>, <, ==，!=, >=, <=
and, or, not
=, +=, -=, *=, /=, %=, //=, **=
运算符的优先级：可以通过加括号改变运算顺序
"""

# 字符串
"""
1.字符串长什么样
2.字符编码(Unicode), chr(), ord()
3.获取单个或者部分字符:字符串[index], 字符串[下标1:下标2:步进]
4.运算：+, *, 比较运算, in, not in, len()
5.相关的方法
"""

# 分之
"""
1.if 条件语句:
    执行语句
    
2.if 条件语句:
    执行语句1
  else:
    执行语句2
    
3.if-elif-else
elif 条件语句:
"""

# 循环结构
"""
1.for循环
for 变量名 in 序列:
    循环体
else:
    

执行过程:


2.while循环
while 条件语句:
    循环体
else:
    
执行过程:

3.break, continue, else
break和continue写在循环体中的
else写在循环外的。循环里面遇到break，else中的语句不会执行
"""
