# 1.求斐波那契数列中第n个数的值：1，1，2，3，5，8，13，21，34....

# n=1和n=2时，第n个数 = 1
# 当n>2, 第n个数 = 第n-1个数 + 第n-2个数
# 1 1 2 3 5 8
"""
p1 = 1
p2 = 1

c = p1+p2 = 2, 3, 5
p1 = p2 = 1= 2, 3
p2 = c = 2 = 3 , 5
"""
# n = int(input('请给出获取第几个数:'))
n = 8
if n == 1 or n == 2:
	current = 1  # 当前的

p1 = 1  # 前一个
p2 = 1  # 前两个
# 求出第n个和第n个前面的所有的数
for index in range(3,n+1):
	# 当前的等于前一个+前两个
	current = p1 + p2
	# 挪动p1和p2
	p1 = p2
	p2 = current

print(current)  


# 2.判断101-200之间有多少个素数，并输出所有素数。
# 什么素数/质数:除了1和它本身，不能被其他的数整除
# 4:1,2,4  5:1,5
count = 0
for x in range(101,201):
	# 在这个地方再来判断x是否是素数
	# (就是将2~x-1中所有的整除拿出来，判断是否能够被x整除，只要有一个余数是0，就说明x不是素数)
	for y in range(2,x):
		if x % y == 0:
			# print("%d不是素数" % (x))
			break  # 这儿的break只能让里面的这个循环结束
	else:
		count += 1
		print(x,'是素数')

print('101~200总共有%d个素数' % (count))

"""
x = 101
	y = 2 ~ 100
	y = 2  101 % 2 == 0
	y = 3  101 % 3 == 0
	y = 4 ...
	....
	y = 100 101%100 == 0

x = 102
	y = 2 ~ 101
	y = 2 102 % 2 == 0  102不是素数  break

x = 103
"""

for x in range(101,201):
	count = 0  # 统计2~x-1中有几个能够被x整除的数

	for y in range(2,x):
		if x % y == 0:
			count += 1
			break
	# 如果2 ~ x-1中没有一个能被x整除的数，说明x是素数
	if count == 0:
		print(x,'是素数')

# 3.打印出所有的水仙花数,所谓水仙花数是指一个三位数，其各位数字立方和等于该数本身。
# 例如：153是一个水仙花数,因为153 = 1^3 + 5^3 + 3^3
for x in range(100,1000):
	ge_wei = x % 10
	shi_wei = x // 10 % 10
	bai_wei = x // 100
	if x == ge_wei**3 + shi_wei**3 + bai_wei**3:
		print('%d是水仙花数' % (x))
			







	






