"""__author__ = 余婷"""

import re

# 1.写一个正则表达式判断一个字符串是否是ip地址
# 规则：一个ip地址由4个数字组成，每个数字之间用.连接。每个数字的大小是0-255
"""
关键是：写一个正则匹配0-255
0-9：\d
10-99：[1-9]\d
100-199：1\d{2}
200-249：2[0-4]\d
250-255：25[0-5]
0-255: \d|[1-9]\d|1\d{2}|2[0-4]\d|25[0-5]
x.x.x.x
(\d|[1-9]\d|1\d{2}|2[0-4]\d|25[0-5]\.){3}(\d|[1-9]\d|1\d{2}|2[0-4]\d|25[0-5])
"""
re_str = r'((\d|[1-9]\d|1\d{2}|2[0-4]\d|25[0-5])\.){3}(\d|[1-9]\d|1\d{2}|2[0-4]\d|25[0-5])'
str1 = '250.78.78.10'
if re.fullmatch(re_str, str1):
    print('是IP地址')
else:
    print('不是IP地址')


# 2.计算一个字符串中所有的数字的和
# 例如：字符串是：‘hello90abc 78sjh12.5’ 结果是90+78+12.5 = 180.5
"""
浮点：[+-]?\d+\.\d+
整数：[+-]?\d+
     
"""
re_str = r'[+-]?\d+\.\d+|[+-]?\d+'
all_number = re.findall(re_str, 'h+10ello90abc 78sjh12.5')
sum1 = 0
for num_str in all_number:
    sum1 += float(num_str)
print(sum1)

# 3.验证输入的内容只能是汉字
str1 = input('请输入汉字:')
# re_str = r'[一-鿋]+'
re_str = r'[\u4E00-\u9FA5]+'
if re.fullmatch(re_str, str1):
    print('全是汉字')
else:
    print('不全是汉字')

# 4.简单的身份证号的验证
"""
1.前六位是数字: \d{6}
2.八位是年月日: 
年：1900-2018 ---- 1900-1999：19\d{2}
                  2000-2009：200\d
                  2010-2018：201[0-8]
月：00-12：01-09：0[1-9]
          10-12：1[0-2]
          
日：00-31：01-09：0[1-9]
          10-29: [1-2]\d
          30-31：3[01]

3.三位数字: \d{3}
4.最后一位是数字或者是X: [\dXx]


\d{6}(19\d{2}|200\d|201[0-8])(0[1-9]|1[0-2])(0[1-9]|[1-2]\d|3[01])\d{3}[\dXx]
"""
# re_str = r'(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)'
re_str = r'\d{6}(19\d{2}|200\d|201[0-8])(0[1-9]|1[0-2])(0[1-9]|[1-2]\d|3[01])\d{3}[\dXx]'
if re.fullmatch(re_str, '500234200004238767'):
    print('是合格的身份证号!')
else:
    print('不是合格的身份证号!')




